stevenlin5928/NC01/GD32F10x_NC01_APP/Board/Board.h
/*!
    \file    gd32f10x_eval.h
    \brief   definitions for GD32F10x_EVAL's leds, keys and COM ports hardware resources

    \version 2024-01-05, V2.3.0, firmware for GD32F10x
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32F10X_EVAL_H
#define GD32F10X_EVAL_H

#ifdef cplusplus
 extern "C" {
#endif

#include "gd32f10x.h"
#include "RingBuffer.h"
#include "w5500_conf.h"
#include "udp_config.h"
#include "fw_update.h"
#include "sio.h"
#include "Led.h"
#include "Beep.h"
#include "wdt_hw.h"

#include "attcp.h"
#include "secstcp.h"
#include "queue.h"
#include "rtc.h"
#include "Crc16_xmodem.h"
#include "rs485.h"
#include "gp_io.h"
#include "app_i2c.h"
#include "sht21.h"
#include "max7219.h"
#include "keypad.h"
/***/

#define APP_OFFSET  ApplicationAddress
#define SUPPORT_ETHERNET 1//W5500
#define SUPPORT_BARCODE  1//Barcode 
#define SUPPORT_OLED     1//OLED
//use U8G2
//#define USE_U8G2


/* exported types */
typedef enum 
{
    LED2 = 0,
    LED3 = 1,
    LED4 = 2,
    LED5 = 3
} led_typedef_enum;

typedef enum 
{
    KEY_WAKEUP = 0,
    KEY_TAMPER = 1,
    KEY_USER   = 2
} key_typedef_enum;

typedef enum 
{
    KEY_MODE_GPIO = 0,
    KEY_MODE_EXTI = 1
} keymode_typedef_enum;

/* eval board low layer led */
#define LEDn                             4U

#define LED2_PIN                         GPIO_PIN_0
#define LED2_GPIO_PORT                   GPIOC
#define LED2_GPIO_CLK                    RCU_GPIOC
  
#define LED3_PIN                         GPIO_PIN_1
#define LED3_GPIO_PORT                   GPIOB
#define LED3_GPIO_CLK                    RCU_GPIOB
  
#define LED4_PIN                         GPIO_PIN_0
#define LED4_GPIO_PORT                   GPIOE
#define LED4_GPIO_CLK                    RCU_GPIOE
  
#define LED5_PIN                         GPIO_PIN_1
#define LED5_GPIO_PORT                   GPIOE
#define LED5_GPIO_CLK                    RCU_GPIOE

#define COMn                             2U

#define EVAL_COM0                        USART0
#define EVAL_COM0_CLK                    RCU_USART0
#define EVAL_COM0_TX_PIN                 GPIO_PIN_9
#define EVAL_COM0_RX_PIN                 GPIO_PIN_10
#define EVAL_COM0_GPIO_PORT              GPIOA
#define EVAL_COM0_GPIO_CLK               RCU_GPIOA

#define EVAL_COM1                        USART1
#define EVAL_COM1_CLK                    RCU_USART1
#define EVAL_COM1_TX_PIN                 GPIO_PIN_2
#define EVAL_COM1_RX_PIN                 GPIO_PIN_3
#define EVAL_COM1_GPIO_PORT              GPIOA
#define EVAL_COM1_GPIO_CLK               RCU_GPIOA

#define KEYn                             3U

/* wakeup push-button */
#define WAKEUP_KEY_PIN                   GPIO_PIN_0
#define WAKEUP_KEY_GPIO_PORT             GPIOA
#define WAKEUP_KEY_GPIO_CLK              RCU_GPIOA
#define WAKEUP_KEY_EXTI_LINE             EXTI_0
#define WAKEUP_KEY_EXTI_PORT_SOURCE      GPIO_PORT_SOURCE_GPIOA
#define WAKEUP_KEY_EXTI_PIN_SOURCE       GPIO_PIN_SOURCE_0
#define WAKEUP_KEY_EXTI_IRQn             EXTI0_IRQn  

/* tamper push-button */
#define TAMPER_KEY_PIN                   GPIO_PIN_13
#define TAMPER_KEY_GPIO_PORT             GPIOC
#define TAMPER_KEY_GPIO_CLK              RCU_GPIOC
#define TAMPER_KEY_EXTI_LINE             EXTI_13
#define TAMPER_KEY_EXTI_PORT_SOURCE      GPIO_PORT_SOURCE_GPIOC
#define TAMPER_KEY_EXTI_PIN_SOURCE       GPIO_PIN_SOURCE_13
#define TAMPER_KEY_EXTI_IRQn             EXTI10_15_IRQn

/* user push-button */
#define USER_KEY_PIN                     GPIO_PIN_14
#define USER_KEY_GPIO_PORT               GPIOB
#define USER_KEY_GPIO_CLK                RCU_GPIOB
#define USER_KEY_EXTI_LINE               EXTI_14
#define USER_KEY_EXTI_PORT_SOURCE        GPIO_PORT_SOURCE_GPIOB
#define USER_KEY_EXTI_PIN_SOURCE         GPIO_PIN_SOURCE_14
#define USER_KEY_EXTI_IRQn               EXTI10_15_IRQn

/* function declarations */
/* configure led GPIO */
void gd_eval_led_init(led_typedef_enum lednum);
/* turn on selected led */
void gd_eval_led_on(led_typedef_enum lednum);
/* turn off selected led */
void gd_eval_led_off(led_typedef_enum lednum);
/* toggle the selected led */
void gd_eval_led_toggle(led_typedef_enum lednum);
/* configure key */
void gd_eval_key_init(key_typedef_enum key_num, keymode_typedef_enum key_mode);
/* return the selected key state */
uint8_t gd_eval_key_state_get(key_typedef_enum key);
/* configure COM port */
void gd_eval_com_init(uint32_t com);
//watchdog init
void HW_wdt_init(void);

/*set vector table*/
void nvic_configuration(void);
void uart2_init(int baudrate);
int uart1_outstr(uint8_t *buf,int len);
int uart2_outstr(uint8_t *buf,int len);
//OLED begin
#if 1
//PB3_SPI3_SCK [2]--OLED_CLK
//PB5_SPI3_MOSI [2]--OLED_DIN
//PB6_I2C1_SCL [2]--OLED_RST
//PB7_I2C1_SDA [2]--OLED_DC
//PA15_SPI3_CS--OLED_CS

#define OLED_D_C_PORT    GPIOB//PB7
#define OLED_D_C_PIN     GPIO_PIN_7

#define OLED_SPI_CS_PORT  GPIOA//PA15
#define OLED_SPI_CS_PIN   GPIO_PIN_15

#define OLED_SPI_PORT_CLK		 GPIOB
#define OLED_SPI_PIN_CLK     GPIO_PIN_3  // PB3 

#define OLED_SPI_PORT_MOSI   GPIOB       // PB5
#define OLED_SPI_PIN_MOSI    GPIO_PIN_5  // PB5

#define OLED_SPI_PORT_RES    GPIOB //PB6
#define OLED_SPI_PIN_RES     GPIO_PIN_6  //PB6


#else
//
#define OLED_D_C_PORT    GPIOC//PC0
#define OLED_D_C_PIN     GPIO_PIN_0

#define OLED_SPI_CS_PORT  GPIOC//PC10
#define OLED_SPI_CS_PIN   GPIO_PIN_10

#define OLED_SPI_PIN_CLK     GPIO_PIN_3  // PC3 _SCK
#define OLED_SPI_PORT_CLK		 GPIOC

#define OLED_SPI_PIN_MOSI    GPIO_PIN_2  // PC2
#define OLED_SPI_PORT_MOSI   GPIOC       // PC2

#define OLED_SPI_PIN_RES     GPIO_PIN_1  //PC1
#define OLED_SPI_PORT_RES    GPIOC //PC1
#endif




//OLED end
#ifdef cplusplus
}
#endif

#endif /* GD32F10X_EVAL_H */
